{
  "title": "Health Paddy Terms and Conditions",
  "introduction": {
    "content": "Welcome to Health Paddy (‘We’, ‘Us’ or ‘Our’) an entity owned by Timbala Technology Limited. By accessing, browsing, or using our website and its services, You acknowledge that You have read, understood and agreed to be bound by these Terms and Conditions.",
    "details": "Your use of our website and mobile application (“Platform”) is governed by these Terms and Conditions, which form the binding agreement between You and Us regarding Your use of our website and mobile application. The following words used in this Terms and Conditions shall have the following meaning: ‘User’ ‘You’ and ‘Your’ refers to You, the person using our services and accepting this Terms and Conditions; 'our service' or 'the service' means the service provided on Our Platform.",
    "note": "Please carefully review these terms and conditions before using the Platform or accessing any data here. Any use of this Platform creates a binding agreement to comply with these terms and conditions. If You do not agree to these terms without limitation or exclusions, You must exit this site immediately."
  },
  "eligibility": {
    "content": "Our services and products are only available to persons above the age of 18. If You are below this age, You must obtain permission from Your parent(s) or guardian before accessing this Platform."
  },
  "consent": {
    "content": "By signing up for our services, You accept and agree to be bound by these Terms and Condition. Any use of this Platform creates a binding agreement to comply with these terms and conditions. If You do not want to agree to these Terms You must not sign up for our services.",
    "minor_clause": "If You are acting on behalf of a minor, the minor is also bound by these Terms."
  },
  "user_conduct": {
    "requirements": [
      "You agree to only use our Platform in a manner that complies with all applicable laws and regulations.",
      "Your use of our Platform, product, and services is solely for Your personal and non-commercial use. We reserve the right in our sole discretion to deny any User access to any of our Platform without prior notice for the following reasons:"
    ],
    "violations": [
      "Use of any material or information, including images or photographs, which are made available through the services in any manner that infringes any copyright, trademark, patent, trade secret, or other proprietary rights of the owner.",
      "Upload files that contain viruses, malware, worms, corrupted files, or any other similar software or programs that may damage the operation of our systems.",
      "Restrict or inhibit any other User from using and enjoying the services or products.",
      "Violate any code of conduct or other guidelines which may be applicable to any particular service or product.",
      "Violate any code of conduct or other guidelines which may be applicable to any particular service or product.",
      "Use, download, or otherwise copy, or provide (whether or not for a fee) to a person or entity any directory of Users of the services or other User or usage information or any portion thereof."
    ]
  },
  "intellectual_property": {
    "ownership": "All present and future rights in and to trade secrets, patents, copyrights, trademarks, service marks, know-how, and other proprietary rights of any type under the laws of any governmental authority, domestic or foreign, including rights in and to all applications and registrations relating to the services provided by this Platform (the “Intellectual Property Rights”) shall, vest in Health Paddy.",
    "responsibilities": "You shall not upload, post or otherwise make available on this Platform, any content protected by copyright, trademark, or other proprietary rights without the express permission of the owner of the copyright, trademark, or other proprietary right and the burden of determining that any material is not protected by copyright rests with You. You shall be solely liable for any damage resulting from any infringement of copyrights, proprietary rights, or any other harm resulting from such a submission.",
    "note": "Reference to any products, services, processes, or other information, by trade name, trademark, manufacturer, supplier, or otherwise does not constitute or imply endorsement, sponsorship, or recommendation of it by Health Paddy."
  },
  "terms": {
    "content": "Health Paddy reserves the right to modify these Terms at any time. Such modifications will become part of this Agreement and will be effective once posted by Us on the Platform. If a revision is material, we will notify You via electronic mail or via a pop-up or redirection when You log in on our Platform. Your continued use of our Services means that You accept any new or modified Terms that we come up with."
  },
  "modifications": {
    "content": "Health Paddy reserves the right to modify these Terms at any time. Such modifications become effective once posted on the Platform."
  },
  "termination": {
    "policy": "In the event that We limit, suspend, or terminate our services, We will provide You with advance notice and use commercially reasonable efforts to narrow the scope and duration of any limitation or suspension, as necessary to resolve the issue that prompted such action, in accordance with these Terms",
    "policytwo": "We reserve the right to suspend Your account immediately without prior notice if we believe it is necessary to protect the security, integrity, or functionality of Our services, or to comply with applicable laws or regulations."
  },
  "member_account": {
    "one": "To use Our Services, You must create an account and provide accurate and complete information during registration. We are committed to safeguarding the privacy of Your information. ",
    "two": "We have implemented robust measures to protect Your information from unauthorized access. However, please be aware that although We endeavor to provide reasonable security for the information we collect and process, we recognize that no security system is completely impenetrable. It is Your responsibility to maintain the confidentiality of Your password and account information. To enhance security, We recommend using a strong password and enabling two-factor authentication.",
    "three": "Please note that You are entirely responsible for any and all activities that occur under Your account and You shall promptly notify Us of any unauthorized use of Your account or any other breach of security. Health Paddy will not be liable for any loss that You may incur as a result of third-party access, either with or without Your knowledge."
  },
  "warranty_disclaimer": {
    "content": [
      "Our services are provided as-is and as-available. We disclaim all warranties, express or implied. We are not responsible for any damages or losses resulting from Your use of the platform. We are not liable for any consequential, incidental, indirect, special, or punitive damages. This disclaimer of warranties applies to the fullest extent permitted by law and survives any termination or expiration of these terms.",
      "Your use of our Platform, product, and services is solely for Your personal and non-commercial use. We reserve the right in our sole discretion to deny any User access to any of our Platform without prior notice for the following reasons:"
    ],
    "disclaimer": [
      "The User expressly agrees that the use of this Platform is at the User’s sole risk. Neither Health Paddy, its affiliates nor any of Our respective employees, agents, third-party service providers, or licensors warrant that this Platform will be uninterrupted or errorfree; nor do We make any warranty as to the results that may be obtained from the use of this Platform, or the accuracy, reliability or content of any information and service provided through this Platform.",

      "We disclaim liability for any damages or injury caused by any failure of performance, error, omission, interruption, deletion, defect, delay in operation or transmission, computer virus, communication line failure, theft or destruction, or unauthorized access to, alteration of, or use of record, whether for breach of contract, tortious behaviour, negligence, or under any other cause of action. ",

      "The User agrees that Our meal plans are designed to provide general guidance and may not accommodate all food allergies, dietary restrictions, or nutritional needs. If You have a specific food allergy, dietary restriction, or nutritional requirement, We recommend consulting a qualified healthcare professional or registered dietitian for personalized advice. Our Services are not a substitute for professional nutrition or health advice, and We strongly advise against relying solely on Our meal plans for nutritional guidance. By using Our Services, You acknowledge that You understand and assume the risks associated with not receiving personalized nutrition advice.",

      "Health Paddy products and services are compatible only with certain devices/tablets/instruments/hardware. Health Paddy shall not be obligated to provide workable products and/or services for any instruments that are not recognized by Health Paddy or those instruments that may be purchased from any third party which are not compatible with Health Paddy products and services. Also, You agree that any defect relating to any devices/tablets/instruments/hardware used to access Our services or products shall be reported to the manufacturer whose details shall be specified on the packaging and Health Paddy shall not be responsible for such defect in any manner.",

      "We may contact Our Users through SMS, email, and call, to give information about Our products as well as notifications on various important updates and/or to seek permission for a demonstration of Our products. You agree to receive these periodic messages.",

      "Upon registration through any means whatsoever, Health Paddy may contact You through the registered mobile number or e-mail or any other mobile number or contact number or email provided by You to enable the effective provision of Our services. You expressly permit Health Paddy to contact them through the above-mentioned means at any time post registration.",

      "All payments are due upon receipt of the invoice, with accepted payment methods. Refunds will only be made in the event of cancellation of subscription within 30 days of payment and such refund will be equivalent to the amount paid by Users for Our Services. No refunds will be issued for cancellation of services due to violation of terms and cancellation of events or services due to circumstances beyond Our control. We reserve the right to modify payment terms at any time, with changes effective immediately upon posting on Our website.",

      "Minors, undischarged, or insolvent persons are not eligible to register for Our products or services. Where a minor wishes to use Our products or Services, such use shall be made available to the minor by his/her legal guardian or parents, who have agreed to these Terms. It is assumed that a minor who utilizes Our services has obtained their legal guardian’s or parent’s consent and that such use is made available by the legal guardian or parents. Health Paddy will not be responsible for any consequence that arises as a result of misuse of any kind of Our application or any of Our products or services that may occur by virtue of any person including a minor registering for the services/products provided. Where it is discovered that a User is under the age of 18 (eighteen) years, Health Paddy reserves the right to terminate the User’s subscription and/or refuse to provide the User with access to the products or services."
    ]
  },

  "miscellaneous": {
    "force_majeure": "We shall not be responsible for any failure or delay in performance due to circumstances beyond Our control, including, without limitation, acts of God, war, riot, acts of civil or military authorities, fire, floods, accidents, service outages resulting from equipment and/or software failure and/or telecommunications failures, power failures, network failures, failures of third-party service providers (including providers of internet services and telecommunications). If You are affected by any such event, You shall notify us within a maximum of seven (7) days from the day You became aware. The performance of these Terms shall then be suspended for as long as any such event shall prevent us from performing our obligations under these Terms",
    "third_party_links": "Third-Party links will take You out of this Platform. Health Paddy provides these links to You only as a convenience, and the inclusion of any link does not imply endorsement by Health Paddy of the third-party mobile application",
    "governing_law": "These Terms shall be governed by and construed in accordance with the laws of the Federal Republic of Nigeria",
    "indemnification": "User agrees to defend, indemnify and hold harmless Health Paddy, its affiliates, and their respective directors, officers, employees, and agents from and against all claims and expenses, including attorneys’ fees, arising out of the use of Health Paddy by User or User’s Account",
    "entire_agreement": "These terms and conditions, together with Our Privacy Policy constitute the entire agreement between You and Us in relation to Your use of Our Platform and supersede all previous agreements in respect of Your use of this Platform.",
    "waiver": "Our failure to enforce any provision of these Terms will not be deemed a waiver of our rights.",
    "severability": "If any provision of these Terms is held invalid, the remaining provisions will remain in effect. Any rights not expressly granted in these Terms are reserved. By using the Platform, You acknowledge that You have read, understood, and agree to be bound by these Terms. If You do not agree to these Terms, please do not use the Platform."
  },
  "contact": {
    "details": "If You have any questions about this Terms and Conditions, please contact Us at www.healthpaddy.com."
  }
}
